python/throught_aware_router_demo/results/2025-03-29_23-13-43/tokens/experiment_1/benchmark.log
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, dataset_name='sharegpt', dataset_path='./LARGER_GAP_short_80_long_20_sharegpt_requests.json', model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, num_prompts=1024, sharegpt_output_len=50, random_input_len=None, random_output_len=None, random_range_ratio=0.0, request_rate=inf, seed=1, multi=False, request_rate_range='2,34,2', output_file=None, disable_tqdm=False, disable_stream=False, disable_ignore_eos=False, extra_request_body=None, max_concurrency=512, gen_num_groups=64, gen_prompts_per_group=16, gen_system_prompt_len=2048, gen_question_len=128, gen_output_len=256)

Total number of conversations: 10925
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
100%|██████████| 1024/1024 [00:35<00:00, 28.67it/s]
outputs[0].ttft = 20.96882646000006
outputs[1].ttft = 20.50432162200002
outputs[2].ttft = 20.503677790999973
outputs[3].ttft = 20.50349904799998
outputs[4].ttft = 20.503483887000016
outputs[5].ttft = 20.503073054000083
outputs[6].ttft = 20.502958295999974
outputs[7].ttft = 20.502933288999998
outputs[8].ttft = 20.50259951700002
outputs[9].ttft = 20.502215194999962
outputs[10].ttft = 20.501875565999967
outputs[11].ttft = 20.501706203000026
outputs[12].ttft = 20.78614264800001
outputs[13].ttft = 20.964960904999998
outputs[14].ttft = 20.96463733400003
outputs[15].ttft = 20.9645009730001
outputs[16].ttft = 20.96448017700004
outputs[17].ttft = 20.96420076700008
outputs[18].ttft = 20.963480239999967
outputs[19].ttft = 20.962938678
outputs[20].ttft = 20.962978873999987
outputs[21].ttft = 20.962367836
outputs[22].ttft = 20.962388352000062
outputs[23].ttft = 21.103689196999994
outputs[24].ttft = 20.782951019999928
outputs[25].ttft = 20.782659909000017
outputs[26].ttft = 20.889665621000063
outputs[27].ttft = 21.102005276
outputs[28].ttft = 21.10170339199999
outputs[29].ttft = 21.10134239399997
outputs[30].ttft = 21.101229320000016
outputs[31].ttft = 21.10071051099999
outputs[32].ttft = 21.10067231900007
outputs[33].ttft = 21.211880963999988
outputs[34].ttft = 20.886993312999948
outputs[35].ttft = 0.0
outputs[36].ttft = 21.21158652400004
outputs[37].ttft = 21.210727613000017
outputs[38].ttft = 21.210451884999998
outputs[39].ttft = 21.21015399700002
outputs[40].ttft = 21.210044409000034
outputs[41].ttft = 21.21032629700005
outputs[42].ttft = 21.209223343999952
outputs[43].ttft = 21.209397121999928
outputs[44].ttft = 21.209872826000037
outputs[45].ttft = 21.35004741099999
outputs[46].ttft = 21.02750042799994
outputs[47].ttft = 21.134689836000007
outputs[48].ttft = 21.596922879999966
outputs[49].ttft = 21.134150859999977
outputs[50].ttft = 21.133252511000023
outputs[51].ttft = 21.133434407000095
outputs[52].ttft = 21.133175551000022
outputs[53].ttft = 21.132431448000034
outputs[54].ttft = 21.13280668899995
outputs[55].ttft = 21.27827246800007
outputs[56].ttft = 21.735646556000006
outputs[57].ttft = 21.37255768900002
outputs[58].ttft = 21.372122590999993
outputs[59].ttft = 21.372134847999973
outputs[60].ttft = 21.371619247000012
outputs[61].ttft = 21.371543680999935
outputs[62].ttft = 21.371185646999947
outputs[63].ttft = 21.54694418100007
outputs[64].ttft = 22.007387342000015
outputs[65].ttft = 21.546209610000005
outputs[66].ttft = 21.545925398999998
outputs[67].ttft = 21.545826723999994
outputs[68].ttft = 21.545362868999973
outputs[69].ttft = 15.054955448999976
outputs[70].ttft = 15.053978663999942
outputs[71].ttft = 15.054529335999973
outputs[72].ttft = 15.054256699999996
outputs[73].ttft = 15.053833094000083
outputs[74].ttft = 15.053595514999984
outputs[75].ttft = 15.053202561000035
outputs[76].ttft = 15.165954776000035
outputs[77].ttft = 14.933247737999977
outputs[78].ttft = 15.052293554000016
outputs[79].ttft = 15.052227099999982
outputs[80].ttft = 15.05184577
outputs[81].ttft = 15.051434284999914
outputs[82].ttft = 15.16450532600004
outputs[83].ttft = 15.16381344399997
outputs[84].ttft = 15.163603910000006
outputs[85].ttft = 15.163257849000047
outputs[86].ttft = 15.16267642999992
outputs[87].ttft = 15.162240892
outputs[88].ttft = 15.300691579000045
outputs[89].ttft = 15.16256203599994
outputs[90].ttft = 15.162242334000098
outputs[91].ttft = 15.161809411000036
outputs[92].ttft = 15.26316005800004
outputs[93].ttft = 15.516157583999984
outputs[94].ttft = 15.264145276000022
outputs[95].ttft = 15.263887870000076
outputs[96].ttft = 15.26271783499999
outputs[97].ttft = 15.261570178000056
outputs[98].ttft = 15.262192624000022
outputs[99].ttft = 15.261711462999983
outputs[100].ttft = 15.260053061000008
outputs[101].ttft = 15.26152213499995
outputs[102].ttft = 15.26106350100008
outputs[103].ttft = 15.26077885999996
outputs[104].ttft = 15.259667128000046
outputs[105].ttft = 15.260194107000075
outputs[106].ttft = 15.258850552000013
outputs[107].ttft = 15.258796847999974
outputs[108].ttft = 15.369098741000016
outputs[109].ttft = 15.36872701599998
outputs[110].ttft = 15.368579696999973
outputs[111].ttft = 15.368298135000032
outputs[112].ttft = 15.368295867999905
outputs[114].ttft = 15.367499810000027
outputs[115].ttft = 15.36765406500001
outputs[116].ttft = 15.367412349999995
outputs[117].ttft = 15.366652747999979
outputs[118].ttft = 15.366539983000052
outputs[119].ttft = 15.366753237000012
outputs[120].ttft = 15.366229850999957
outputs[121].ttft = 15.355612882999935
outputs[122].ttft = 15.355877770999996
outputs[123].ttft = 15.497923161000017
outputs[124].ttft = 15.497718476999921
outputs[125].ttft = 15.355025189999992
outputs[126].ttft = 15.496984729000019
outputs[127].ttft = 15.496624525000016
outputs[128].ttft = 15.603922011999998
outputs[129].ttft = 15.748254158000009
outputs[130].ttft = 15.60332543900006
outputs[131].ttft = 15.74817176199997
outputs[132].ttft = 15.747768705999988
outputs[133].ttft = 15.74754757300002
outputs[134].ttft = 15.74742310399995
outputs[135].ttft = 15.746589382000025
outputs[136].ttft = 15.746531617000073
outputs[137].ttft = 15.923237572999938
outputs[138].ttft = 15.746079698000017
outputs[139].ttft = 15.745747534000088
outputs[140].ttft = 15.745645224999976
outputs[141].ttft = 15.745482828999911
outputs[142].ttft = 15.745183742999984
outputs[143].ttft = 15.744850959000019
outputs[144].ttft = 15.744622505999928
outputs[145].ttft = 15.992412117000072
outputs[146].ttft = 16.02903929499996
outputs[147].ttft = 16.028523339000003
outputs[148].ttft = 16.02828285699991
outputs[149].ttft = 16.028086114000075
outputs[150].ttft = 16.027645092999933
outputs[151].ttft = 16.027465516999996
outputs[152].ttft = 16.027322297999945
outputs[153].ttft = 16.027014668999982
outputs[154].ttft = 16.172666018000086
outputs[155].ttft = 15.98966378199998
outputs[156].ttft = 15.989489480999964
outputs[157].ttft = 15.989072491999991
outputs[158].ttft = 15.988617743999953
outputs[159].ttft = 0.0
outputs[160].ttft = 16.171142972999974
outputs[161].ttft = 16.170916982999984
outputs[162].ttft = 16.170414154000014
outputs[163].ttft = 16.17015354399996
outputs[164].ttft = 16.17011266899999
outputs[165].ttft = 16.278482376999932
outputs[166].ttft = 16.132071096000004
outputs[167].ttft = 16.131355425000038
outputs[168].ttft = 16.13089958599994
outputs[169].ttft = 16.130702455000005
outputs[170].ttft = 16.13033480899992
outputs[171].ttft = 16.12990699799991
outputs[172].ttft = 16.12998144900007
outputs[173].ttft = 16.12967806300003
outputs[174].ttft = 16.41543720100003
outputs[175].ttft = 16.275093571999946
outputs[176].ttft = 16.27456530799998
outputs[177].ttft = 16.27460776700002
outputs[178].ttft = 16.27443800100002
outputs[179].ttft = 16.27399745999992
outputs[180].ttft = 16.273706274000006
outputs[181].ttft = 16.52488044800009
outputs[182].ttft = 16.52449251300004
outputs[183].ttft = 16.524126334000016
outputs[184].ttft = 16.52381991499999
outputs[185].ttft = 16.522963249999975
outputs[186].ttft = 16.52331629799994
outputs[187].ttft = 16.52302612599999
outputs[188].ttft = 16.522551814000053
outputs[189].ttft = 16.52181598499999
outputs[190].ttft = 16.52177593500005
outputs[191].ttft = 16.521408627000028
outputs[192].ttft = 16.521703321000018
outputs[193].ttft = 16.52080927899999
outputs[194].ttft = 16.66542803699997
outputs[195].ttft = 16.519924920999983
outputs[196].ttft = 16.520447709999985
outputs[197].ttft = 16.51967662700008
outputs[198].ttft = 16.519862439000008
outputs[199].ttft = 16.51958961999992
outputs[200].ttft = 16.66368163200002
outputs[201].ttft = 16.518732431000103
outputs[202].ttft = 16.84768588199995
outputs[203].ttft = 16.518218391000005
outputs[204].ttft = 16.518329666
outputs[205].ttft = 16.51776638299998
outputs[206].ttft = 16.517309419999947
outputs[207].ttft = 16.768418279000002
outputs[208].ttft = 16.84587964800005
outputs[209].ttft = 16.845777929000064
outputs[210].ttft = 16.84558598700005
outputs[211].ttft = 16.918500074999997
outputs[212].ttft = 16.76734641799999
outputs[213].ttft = 16.767018781000047
outputs[214].ttft = 16.76652090999994
outputs[215].ttft = 16.88029253000002
outputs[216].ttft = 16.91753199799996
outputs[217].ttft = 16.916765279999936
outputs[218].ttft = 16.916694067000094
outputs[219].ttft = 16.916277515000047
outputs[220].ttft = 16.915884578999908
outputs[221].ttft = 16.915957262000006
outputs[222].ttft = 16.915379115000064
outputs[223].ttft = 16.91476029399996
outputs[224].ttft = 16.91554130199995
outputs[225].ttft = 16.914752876999955
outputs[226].ttft = 17.059266418999982
outputs[227].ttft = 17.05914359299993
outputs[228].ttft = 17.058814310000002
outputs[229].ttft = 17.05849055500005
outputs[230].ttft = 17.05825930000003
outputs[231].ttft = 17.05753765899999
outputs[232].ttft = 17.057416267999997
outputs[233].ttft = 17.057191774000103
outputs[234].ttft = 17.05716930699998
outputs[235].ttft = 14.879219146999958
outputs[236].ttft = 17.345218945000056
outputs[237].ttft = 16.873403708999945
outputs[238].ttft = 16.87295746199993
outputs[239].ttft = 16.872804755999937
outputs[240].ttft = 17.017122708999977
outputs[241].ttft = 17.017008413999974
outputs[242].ttft = 17.342357936999974
outputs[243].ttft = 17.23207220500001
outputs[244].ttft = 17.33983772499994
outputs[245].ttft = 16.905657376000022
outputs[246].ttft = 17.01647393099995
outputs[247].ttft = 17.01547248899999
outputs[248].ttft = 17.015225570000098
outputs[249].ttft = 17.007380474
outputs[250].ttft = 17.007069797999975
outputs[251].ttft = 17.00738226100009
outputs[252].ttft = 17.007106893000014
outputs[253].ttft = 17.007856567999966
outputs[254].ttft = 17.007492535999972
outputs[255].ttft = 17.00655929000004
outputs[256].ttft = 17.18489686999999
outputs[257].ttft = 17.18455866499994
outputs[258].ttft = 17.18445390399995
outputs[259].ttft = 17.184161063000033
outputs[260].ttft = 17.183626429000014
outputs[261].ttft = 17.18365694900001
outputs[262].ttft = 17.183249665000062
outputs[263].ttft = 17.182725557000026
outputs[264].ttft = 17.182748435000008
outputs[265].ttft = 17.18241220699997
outputs[266].ttft = 17.182282149999992
outputs[267].ttft = 17.181924721999962
outputs[268].ttft = 17.255106434000027
outputs[269].ttft = 17.32622482299996
outputs[270].ttft = 17.326136479999946
outputs[271].ttft = 17.325859393999963
outputs[272].ttft = 17.32520259399996
outputs[273].ttft = 17.32489591600006
outputs[274].ttft = 17.325191570000015
outputs[275].ttft = 17.32495242099992
outputs[276].ttft = 17.324689725999974
outputs[277].ttft = 17.43107923499997
outputs[278].ttft = 17.395044030000008
outputs[279].ttft = 17.715659587999994
outputs[280].ttft = 17.394846616999985
outputs[281].ttft = 17.715059228000086
outputs[282].ttft = 17.714816845000087
outputs[283].ttft = 17.714443676999963
outputs[284].ttft = 17.714316108999924
outputs[285].ttft = 17.50104717499994
outputs[286].ttft = 17.713538157000016
outputs[287].ttft = 17.71323720700002
outputs[288].ttft = 0.0
outputs[289].ttft = 17.499988327999972
outputs[290].ttft = 17.499722230999964
outputs[291].ttft = 17.49918324700002
outputs[292].ttft = 17.498914232999937
outputs[293].ttft = 17.67497090500001
outputs[294].ttft = 18.249556045999952
outputs[295].ttft = 17.674193254999977
outputs[296].ttft = 17.67393697900002
outputs[297].ttft = 17.673694126999976
outputs[298].ttft = 17.67376427599993
outputs[299].ttft = 17.673511853000036
outputs[300].ttft = 17.67287861300008
outputs[301].ttft = 17.672622505999925
outputs[302].ttft = 17.672693370000047
outputs[303].ttft = 17.672424492000005
outputs[304].ttft = 17.67211355400002
outputs[305].ttft = 17.67173306299992
outputs[306].ttft = 17.781142670999998
outputs[307].ttft = 18.24624420500004
outputs[308].ttft = 18.245972575999986
outputs[309].ttft = 18.245671983999955
outputs[310].ttft = 18.24537381199991
outputs[311].ttft = 18.244034575
outputs[312].ttft = 18.244060350999916
outputs[313].ttft = 18.350214198000003
outputs[314].ttft = 17.77839221699992
outputs[315].ttft = 17.77811980299998
outputs[316].ttft = 17.777775631000054
outputs[317].ttft = 17.777504636000003
outputs[318].ttft = 17.77722372100004
outputs[319].ttft = 0.0
outputs[320].ttft = 18.348383419000015
outputs[321].ttft = 18.348438826000006
outputs[322].ttft = 18.491544094000005
outputs[323].ttft = 17.884003056000097
outputs[324].ttft = 17.883743699999968
outputs[325].ttft = 17.883387448999997
outputs[326].ttft = 18.02913215199999
outputs[327].ttft = 18.603643813000076
outputs[328].ttft = 18.028460687000006
outputs[329].ttft = 18.027929601999972
outputs[330].ttft = 18.02750734899996
outputs[331].ttft = 18.027304053999956
outputs[332].ttft = 18.02685643899997
outputs[333].ttft = 18.02685462699992
outputs[334].ttft = 18.0265760420001
outputs[335].ttft = 18.026701572000093
outputs[336].ttft = 18.02620393799998
outputs[337].ttft = 18.025793195000006
outputs[338].ttft = 18.025590268999963
outputs[339].ttft = 18.02511047400003
outputs[340].ttft = 18.024649023000052
outputs[341].ttft = 18.02505424499998
outputs[342].ttft = 18.024653830000034
outputs[343].ttft = 18.130180775999975
outputs[344].ttft = 18.739621866999983
outputs[345].ttft = 18.27079277200005
outputs[346].ttft = 18.73883355099997
outputs[347].ttft = 18.738637072000074
outputs[348].ttft = 18.73816634000002
outputs[349].ttft = 18.377029503000017
outputs[350].ttft = 18.73769486499998
outputs[351].ttft = 18.73719775299992
outputs[352].ttft = 18.88221114600003
outputs[353].ttft = 18.882476132999955
outputs[354].ttft = 18.88223609099998
outputs[355].ttft = 18.88198697400003
outputs[356].ttft = 18.881578090000062
outputs[357].ttft = 18.88131750499997
outputs[358].ttft = 18.550031118999982
outputs[359].ttft = 18.88067876699995
outputs[360].ttft = 18.880411198000047
outputs[361].ttft = 18.88033469700008
outputs[362].ttft = 18.87966612599996
outputs[363].ttft = 19.02143812500003
outputs[364].ttft = 19.12878987299996
outputs[365].ttft = 18.548241690000054
outputs[366].ttft = 18.628775883999992
outputs[367].ttft = 19.127883523000037
outputs[368].ttft = 19.127248190000046
outputs[369].ttft = 19.126966819000017
outputs[370].ttft = 19.127214457000036
outputs[371].ttft = 19.12694276900004
outputs[372].ttft = 19.126531150000005
outputs[373].ttft = 19.232141231000014
outputs[374].ttft = 18.766948135999996
outputs[375].ttft = 19.23166652900011
outputs[376].ttft = 19.231361559999982
outputs[377].ttft = 19.23114573500004
outputs[378].ttft = 19.37395260800008
outputs[379].ttft = 18.874528716999976
outputs[380].ttft = 19.512671278000084
outputs[381].ttft = 19.05162374400004
outputs[382].ttft = 19.51170223500003
outputs[383].ttft = 19.617879850999998
outputs[384].ttft = 19.264808721999998
outputs[385].ttft = 19.617223144000036
outputs[386].ttft = 19.616945504
outputs[387].ttft = 19.761044848999973
outputs[388].ttft = 19.263667348000013
outputs[389].ttft = 19.263211266999974
outputs[390].ttft = 19.26284625900007
outputs[391].ttft = 19.759859217999974
outputs[392].ttft = 19.934525770999926
outputs[393].ttft = 19.262269831000026
outputs[394].ttft = 19.261951759
outputs[395].ttft = 19.40439677100005
outputs[396].ttft = 19.93337965899991
outputs[397].ttft = 19.403812256000037
outputs[398].ttft = 19.93279122900003
outputs[399].ttft = 19.403215090000003
outputs[400].ttft = 19.932464197999934
outputs[401].ttft = 20.004182370999956
outputs[402].ttft = 19.93182058600007
outputs[403].ttft = 20.328158713999983
outputs[404].ttft = 20.003192285999944
outputs[405].ttft = 20.00292097099998
outputs[406].ttft = 20.002106303999994
outputs[407].ttft = 20.001716962000046
outputs[408].ttft = 20.002885544999913
outputs[409].ttft = 20.001721850999957
outputs[410].ttft = 20.001341841
outputs[411].ttft = 20.10871097100005
outputs[412].ttft = 20.32540506500004
outputs[413].ttft = 20.429209942000057
outputs[414].ttft = 20.428878037999993
outputs[415].ttft = 20.570191724999972
outputs[416].ttft = 20.10701316799998
outputs[417].ttft = 20.107021550000013
outputs[418].ttft = 20.106645810000032
outputs[419].ttft = 20.106433195000022
outputs[420].ttft = 20.106120435000093
outputs[421].ttft = 20.105650387999958
outputs[422].ttft = 20.24836457699996
outputs[423].ttft = 20.568084624999983
outputs[424].ttft = 21.317625249999992
outputs[513].ttft = 7.045258881999985
outputs[514].ttft = 7.270740721000038
outputs[515].ttft = 7.205808638000008
outputs[516].ttft = 7.200142765999999
outputs[517].ttft = 7.195628953999972
outputs[518].ttft = 7.289586503999999
outputs[519].ttft = 7.396797561999961
outputs[520].ttft = 7.457457664999993
outputs[521].ttft = 7.570137479999971
outputs[522].ttft = 7.534763075000001
outputs[523].ttft = 7.707896667999989
outputs[524].ttft = 7.707258921999937
outputs[525].ttft = 7.246680722000065
outputs[526].ttft = 7.246579376
outputs[527].ttft = 7.245796874999996
outputs[528].ttft = 7.244846288999952
outputs[529].ttft = 7.244181107000031
outputs[530].ttft = 7.24310776599998
outputs[531].ttft = 7.242783377000023
outputs[532].ttft = 7.24241681400008
outputs[533].ttft = 7.24182116999998
outputs[534].ttft = 7.347542099000066
outputs[535].ttft = 7.346993855000051
outputs[536].ttft = 7.346287691000043
outputs[537].ttft = 7.345937615000025
outputs[538].ttft = 7.345117587000004
outputs[539].ttft = 7.344415346000005
outputs[540].ttft = 7.486305948999984
outputs[541].ttft = 7.485770018000039
outputs[542].ttft = 7.485253640999986
outputs[543].ttft = 7.48449463999998
outputs[544].ttft = 7.483440567999992
outputs[545].ttft = 7.482917284999985
outputs[546].ttft = 7.482005178999998
outputs[547].ttft = 7.76428858700001
outputs[548].ttft = 7.763658683000017
outputs[549].ttft = 7.6900147110000034
outputs[550].ttft = 7.689919662000079
outputs[551].ttft = 7.688699266999947
outputs[552].ttft = 7.688265021999996
outputs[553].ttft = 7.7606011220000255
outputs[554].ttft = 7.904019769000001
outputs[555].ttft = 7.903735756999936
outputs[556].ttft = 7.903403464000007
outputs[557].ttft = 7.9019789809999565
outputs[558].ttft = 7.901993093999977
outputs[559].ttft = 7.901512013999991
outputs[560].ttft = 7.90045928699999
outputs[561].ttft = 7.755121451000036
outputs[562].ttft = 7.862105861999908
outputs[563].ttft = 7.860820546000014
outputs[564].ttft = 7.860368220000055
outputs[565].ttft = 7.859688350000056
outputs[566].ttft = 8.181295034000073
outputs[567].ttft = 8.179799532000061
outputs[568].ttft = 8.509581701000002
outputs[569].ttft = 8.509239107000099
outputs[570].ttft = 8.54564192700002
outputs[571].ttft = 8.545271506000063
outputs[572].ttft = 8.544901397999979
outputs[573].ttft = 7.890722724999932
outputs[574].ttft = 8.50502810799992
outputs[575].ttft = 8.50442633800003
outputs[576].ttft = 8.503810112999986
outputs[577].ttft = 8.502502372000095
outputs[578].ttft = 8.502033455999936
outputs[579].ttft = 8.501386120000006
outputs[580].ttft = 8.501383081999961
outputs[581].ttft = 8.612725735000026
outputs[582].ttft = 8.612216031999992
outputs[583].ttft = 8.610950385000024
outputs[584].ttft = 8.75332154900002
outputs[585].ttft = 8.536668077000058
outputs[586].ttft = 8.535959444000014
outputs[587].ttft = 8.535937037000053
outputs[588].ttft = 8.534535504000019
outputs[589].ttft = 8.533748392999996
outputs[590].ttft = 8.533591193999996
outputs[591].ttft = 8.818156015
outputs[592].ttft = 8.816703677000078
outputs[593].ttft = 8.816514632000008
outputs[594].ttft = 8.816158637999933
outputs[595].ttft = 8.815836673000035
outputs[596].ttft = 9.418953538000096
outputs[597].ttft = 8.885854102000053
outputs[598].ttft = 8.884581725999965
outputs[599].ttft = 8.883997437999938
outputs[600].ttft = 0.0
outputs[601].ttft = 9.209833656
outputs[602].ttft = 9.209277322000048
outputs[603].ttft = 9.096468314000049
outputs[604].ttft = 9.096447059999946
outputs[605].ttft = 9.096427013000039
outputs[606].ttft = 9.095416290000003
outputs[607].ttft = 9.095220831999995
outputs[608].ttft = 9.095068250000054
outputs[609].ttft = 0.0
outputs[610].ttft = 9.135460722000062
outputs[611].ttft = 9.24812547900001
outputs[612].ttft = 9.248180954999953
outputs[613].ttft = 9.247975901000018
outputs[614].ttft = 9.148107308000021
outputs[615].ttft = 9.14777299900004
outputs[616].ttft = 9.147607402999938
outputs[617].ttft = 9.147300251000047
outputs[618].ttft = 9.146881786999984
outputs[619].ttft = 9.426218242999994
outputs[620].ttft = 9.425745526000014
outputs[621].ttft = 8.991018420999922
outputs[622].ttft = 8.991553296000006
outputs[623].ttft = 8.991757316000076
outputs[624].ttft = 8.922098697000024
outputs[625].ttft = 8.921575558999962
outputs[626].ttft = 8.920537766000052
outputs[627].ttft = 8.920555099000012
outputs[628].ttft = 8.961297972000011
outputs[629].ttft = 8.960501021000027
outputs[630].ttft = 8.960382603000085
outputs[631].ttft = 8.960211042000083
outputs[632].ttft = 8.960484191999967
outputs[633].ttft = 9.353057307999961
outputs[634].ttft = 9.352759034999963
outputs[635].ttft = 9.492193494000048
outputs[636].ttft = 9.491138134000039
outputs[637].ttft = 9.769231296000044
outputs[638].ttft = 9.768973997999979
outputs[639].ttft = 9.84338400699994
outputs[640].ttft = 9.736198964000096
outputs[641].ttft = 9.735506215999976
outputs[642].ttft = 9.734781092000048
outputs[643].ttft = 9.735070471000085
outputs[644].ttft = 9.734857103999957
outputs[645].ttft = 8.815798500000028
outputs[646].ttft = 8.815591422000011
outputs[647].ttft = 8.815233959000011
outputs[648].ttft = 8.81581543699997
outputs[649].ttft = 8.814955505999933
outputs[650].ttft = 8.815190897999969
outputs[651].ttft = 8.813628494
outputs[652].ttft = 8.814010437999968
outputs[653].ttft = 8.81346987400002
outputs[654].ttft = 8.813900308999905
outputs[655].ttft = 8.710946239000009
outputs[656].ttft = 8.709567784
outputs[657].ttft = 9.628229970999996
outputs[658].ttft = 9.627790774999994
outputs[659].ttft = 9.627380254000059
outputs[660].ttft = 9.522012803000052
outputs[661].ttft = 9.66347825899993
outputs[662].ttft = 9.516405941000016
outputs[663].ttft = 9.516286434999984
outputs[664].ttft = 9.515326588999983
outputs[665].ttft = 9.514974069999994
outputs[666].ttft = 9.514884843999994
outputs[667].ttft = 9.687135154999964
outputs[668].ttft = 9.687000292999983
outputs[669].ttft = 8.454713846999994
outputs[670].ttft = 8.742274594999913
outputs[671].ttft = 8.741990723999947
outputs[672].ttft = 8.846734917000049
outputs[673].ttft = 8.98533549199999
outputs[674].ttft = 8.985361987000033
outputs[675].ttft = 8.984858051999936
outputs[676].ttft = 8.814530541999943
outputs[677].ttft = 8.742044705000012
outputs[678].ttft = 9.441287389999957
outputs[679].ttft = 8.741385831999992
outputs[680].ttft = 8.740718762000029
outputs[681].ttft = 9.440022517999978
outputs[682].ttft = 9.406432306999932
outputs[683].ttft = 9.405564949999984
outputs[684].ttft = 9.477154808000023
outputs[685].ttft = 9.47653156900003
outputs[686].ttft = 9.476698307999982
outputs[687].ttft = 9.476119519000008
outputs[688].ttft = 9.476325524000003
outputs[689].ttft = 9.47567225399996
outputs[690].ttft = 0.0
outputs[691].ttft = 9.508456471000045
outputs[692].ttft = 9.50788605699995
outputs[693].ttft = 8.59427296499996
outputs[694].ttft = 8.593804595000051
outputs[695].ttft = 8.593833674999928
outputs[696].ttft = 8.593046268999956
outputs[697].ttft = 8.593432962999941
outputs[698].ttft = 8.593234505000055
outputs[699].ttft = 8.802006333999998
outputs[700].ttft = 8.944793118000007
outputs[701].ttft = 8.94498544399994
outputs[702].ttft = 8.944257329000038
outputs[703].ttft = 8.94404478399997
outputs[704].ttft = 8.94408384899998
outputs[705].ttft = 9.331444773000044
outputs[706].ttft = 9.475095191000037
outputs[707].ttft = 9.474644279000017
outputs[708].ttft = 9.474423978000004
outputs[709].ttft = 9.474228605999997
outputs[710].ttft = 9.473745786999984
outputs[711].ttft = 10.456816610000033
outputs[712].ttft = 10.352524464999988
outputs[713].ttft = 10.238519873999962
outputs[714].ttft = 10.238032688999965
outputs[715].ttft = 10.237047066999935
outputs[716].ttft = 10.236687133000032
outputs[717].ttft = 8.580938514000081
outputs[718].ttft = 8.580915596999944
outputs[719].ttft = 8.58031452800003
outputs[720].ttft = 8.580696277000015
outputs[721].ttft = 8.858196823999947
outputs[722].ttft = 8.965976453000053
outputs[723].ttft = 8.965616092999994
outputs[724].ttft = 10.47597232299995
outputs[725].ttft = 8.964331992000098
outputs[726].ttft = 8.963621873999955
outputs[727].ttft = 9.105068332000087
outputs[728].ttft = 9.104797459999986
outputs[729].ttft = 10.474611933000006
outputs[730].ttft = 10.474265161000062
outputs[731].ttft = 10.467151651999984
outputs[732].ttft = 10.466646330999993
outputs[733].ttft = 10.466796950999992
outputs[734].ttft = 10.466092502999913
outputs[735].ttft = 10.572096324999961
outputs[736].ttft = 10.445671513999969
outputs[737].ttft = 10.582062159999964
outputs[738].ttft = 10.432847094000067
outputs[739].ttft = 10.584258562000059
outputs[740].ttft = 10.583733711000036
outputs[741].ttft = 8.819524336999962
outputs[742].ttft = 8.782931316000031
outputs[743].ttft = 8.782787299999995
outputs[744].ttft = 8.782889066000052
outputs[745].ttft = 8.782232700999998
outputs[746].ttft = 8.746882690000007
outputs[747].ttft = 8.747233110000025
outputs[748].ttft = 8.746564941999964
outputs[749].ttft = 8.746649883000032
outputs[750].ttft = 8.710655365999969
outputs[751].ttft = 8.74654426799998
outputs[752].ttft = 8.7463120110001
outputs[753].ttft = 10.629166760999965
outputs[754].ttft = 10.629067884999927
outputs[755].ttft = 10.62876295600006
outputs[756].ttft = 10.737584487999925
outputs[757].ttft = 10.737247077000006
outputs[758].ttft = 10.736756743
outputs[759].ttft = 10.73688038399996
outputs[760].ttft = 10.735816546000024
outputs[761].ttft = 10.631298583999978
outputs[762].ttft = 10.630580338999948
outputs[763].ttft = 10.630305163000003
outputs[764].ttft = 10.592859464999947
outputs[765].ttft = 8.7088064940001
outputs[766].ttft = 8.775763678999965
outputs[767].ttft = 8.811628294999991
outputs[768].ttft = 8.84540615700007
outputs[769].ttft = 8.879815592
outputs[770].ttft = 8.913690824000014
outputs[771].ttft = 8.947626761000038
outputs[772].ttft = 8.982125062000023
outputs[773].ttft = 9.033796467000002
outputs[774].ttft = 9.170833253999945
outputs[775].ttft = 9.170243121999988
outputs[776].ttft = 9.341348737999965
outputs[777].ttft = 10.519319554000049
outputs[778].ttft = 10.51877342499995
outputs[779].ttft = 10.518802276000088
outputs[780].ttft = 10.517940384999974
outputs[781].ttft = 10.517745822999927
outputs[782].ttft = 10.517844346999937
outputs[783].ttft = 10.341251965999959
outputs[784].ttft = 10.44573906200003
outputs[785].ttft = 10.44545145099994
outputs[786].ttft = 10.586394926999901
outputs[787].ttft = 10.58598481599995
outputs[788].ttft = 10.727527697000028
outputs[789].ttft = 10.72746994199997
outputs[790].ttft = 10.899753053999916
outputs[791].ttft = 9.472497127999986
outputs[792].ttft = 9.507552189999956
outputs[793].ttft = 9.540995327000019
outputs[794].ttft = 9.575398603999929
outputs[795].ttft = 9.578870106999943
outputs[796].ttft = 9.683486657999993
outputs[797].ttft = 9.683159734000014
outputs[798].ttft = 9.646719925999946
outputs[799].ttft = 9.610197251000045
outputs[800].ttft = 9.644996673999913
outputs[801].ttft = 10.757869940999967
outputs[802].ttft = 10.757581939000033
outputs[803].ttft = 10.757159315999957
outputs[804].ttft = 10.756975184999988
outputs[805].ttft = 10.756939499000055
outputs[806].ttft = 10.842829106999943
outputs[807].ttft = 10.842530072000045
outputs[808].ttft = 10.77411765699992
outputs[809].ttft = 10.913751746999992
outputs[810].ttft = 10.877883495999981
outputs[811].ttft = 11.04981980499997
outputs[812].ttft = 11.049459100000036
outputs[813].ttft = 10.018425524999998
outputs[814].ttft = 0.0
outputs[815].ttft = 10.157247930999915
outputs[816].ttft = 9.981073831999993
outputs[817].ttft = 10.017248790000053
outputs[818].ttft = 10.052058405000025
outputs[819].ttft = 10.08638768100002
outputs[820].ttft = 10.12151173199993
outputs[821].ttft = 10.157495110000013
outputs[822].ttft = 10.192240423000044
outputs[823].ttft = 10.869540962999963
outputs[824].ttft = 10.86980366399996
outputs[825].ttft = 10.86922123599993
outputs[826].ttft = 10.869310342999938
outputs[827].ttft = 10.868377624999994
outputs[828].ttft = 10.835684446999949
outputs[829].ttft = 10.83545643299999
outputs[830].ttft = 10.834995584000012
outputs[831].ttft = 10.976618669000004
outputs[832].ttft = 10.97647083600009
outputs[833].ttft = 10.97625631599999
outputs[834].ttft = 11.046303899000009
outputs[835].ttft = 10.975900769999953
outputs[836].ttft = 10.975413471000024
outputs[837].ttft = 10.658936411000013
outputs[838].ttft = 10.725698069000032
outputs[839].ttft = 10.761643471999946
outputs[840].ttft = 10.797145539999974
outputs[841].ttft = 10.799303272999964
outputs[842].ttft = 10.762735741999904
outputs[843].ttft = 10.79818347999992
outputs[844].ttft = 10.83314137700006
outputs[845].ttft = 10.868344449000006
outputs[846].ttft = 10.79340571900002
outputs[847].ttft = 10.829139590999944
outputs[848].ttft = 10.828132925999967
outputs[849].ttft = 10.828003214999967
outputs[850].ttft = 10.895287317999987
outputs[851].ttft = 10.929879202000052
outputs[852].ttft = 10.964213571000073
outputs[853].ttft = 10.999133984000082
outputs[854].ttft = 11.033436243999972
outputs[855].ttft = 11.067451328999937
outputs[856].ttft = 11.101359530999957
outputs[857].ttft = 11.135370657000067
outputs[858].ttft = 11.195695827000009
outputs[859].ttft = 11.231045402000063
outputs[860].ttft = 11.26680035700008
outputs[861].ttft = 11.443746880000049
outputs[862].ttft = 11.379154741999969
outputs[863].ttft = 11.271376635000024
outputs[864].ttft = 11.409032950999972
outputs[865].ttft = 11.40867554600004
outputs[866].ttft = 11.408392749999962
outputs[867].ttft = 11.407648244999905
outputs[868].ttft = 11.407490888999973
outputs[869].ttft = 11.441972778999911
outputs[870].ttft = 11.444980348999934
outputs[871].ttft = 11.408778182999981
outputs[872].ttft = 11.443531774999997
outputs[873].ttft = 0.0
outputs[874].ttft = 11.728818354000055
outputs[875].ttft = 11.682850192000046
outputs[876].ttft = 11.647377867000046
outputs[877].ttft = 11.64685168199992
outputs[878].ttft = 11.612545218000037
outputs[879].ttft = 11.578377650999983
outputs[880].ttft = 11.470080187000008
outputs[881].ttft = 11.60772521499996
outputs[882].ttft = 12.005136446000051
outputs[883].ttft = 12.283439898999973
outputs[884].ttft = 12.283316667000008
outputs[885].ttft = 12.283126978000041
outputs[886].ttft = 12.25018235999994
outputs[887].ttft = 12.137652343000013
outputs[888].ttft = 0.0
outputs[889].ttft = 12.27578353499996
outputs[890].ttft = 12.518777931000045
outputs[891].ttft = 12.518453910000062
outputs[892].ttft = 12.517721165000012
outputs[893].ttft = 12.51776578600004
outputs[894].ttft = 12.517467257000021
outputs[895].ttft = 12.517035511000017
outputs[896].ttft = 12.517142196000009
outputs[897].ttft = 12.516984313999956
outputs[898].ttft = 12.381221234999998
outputs[899].ttft = 12.344988595000018
outputs[900].ttft = 12.27447998699995
outputs[901].ttft = 12.412447168999961
outputs[902].ttft = 12.412142655000025
outputs[903].ttft = 12.552987733999998
outputs[904].ttft = 12.55258624999999
outputs[905].ttft = 12.552424624000082
outputs[906].ttft = 12.552258649999999
outputs[907].ttft = 12.44681609099996
outputs[908].ttft = 12.446061098999962
outputs[909].ttft = 12.719365998000058
outputs[910].ttft = 12.719017678
outputs[911].ttft = 12.958177743999954
outputs[912].ttft = 12.957741990000045
outputs[913].ttft = 12.957159438999952
outputs[914].ttft = 12.95708541700003
outputs[915].ttft = 12.956866450999996
outputs[916].ttft = 13.405878956000038
outputs[917].ttft = 13.267891169999984
outputs[918].ttft = 13.231410009000001
outputs[919].ttft = 13.231146502000001
outputs[920].ttft = 13.230938658000014
outputs[921].ttft = 13.265561014000014
outputs[922].ttft = 13.264655977000075
outputs[923].ttft = 13.259119800000008
outputs[924].ttft = 13.258655011000087
outputs[925].ttft = 13.25833189499997
outputs[926].ttft = 13.118507400999988
outputs[927].ttft = 0.0
outputs[928].ttft = 13.080653495999968
outputs[929].ttft = 13.080309768000006
outputs[930].ttft = 13.217234230000031
outputs[931].ttft = 13.217009054999949
outputs[932].ttft = 13.216517875000022
outputs[933].ttft = 13.146739391999972
outputs[934].ttft = 13.14641983499996
outputs[935].ttft = 13.287001405999945
outputs[936].ttft = 13.286615115000018
outputs[937].ttft = 13.286330370999963
outputs[938].ttft = 13.285756058999937
outputs[939].ttft = 13.390949865000039
outputs[940].ttft = 0.0
outputs[941].ttft = 13.475211840000043
outputs[942].ttft = 13.47498960300004
outputs[943].ttft = 13.474457962000088
outputs[944].ttft = 13.473940691000053
outputs[945].ttft = 12.48676927200006
outputs[946].ttft = 12.55430195200006
outputs[947].ttft = 12.58865364799999
outputs[948].ttft = 12.479341411000064
outputs[949].ttft = 12.513620444000026
outputs[950].ttft = 12.547316653000053
outputs[951].ttft = 12.581569434000016
outputs[952].ttft = 12.755148215000077
outputs[953].ttft = 13.327242757000022
outputs[954].ttft = 13.327181085999996
outputs[955].ttft = 13.372232427999961
outputs[956].ttft = 12.789410898999904
outputs[957].ttft = 12.789080883999986
outputs[958].ttft = 12.85535538800002
outputs[959].ttft = 12.887225722999915
outputs[960].ttft = 12.82429088799995
outputs[961].ttft = 12.859479418000092
outputs[962].ttft = 12.823932068999966
outputs[963].ttft = 12.85952736899992
outputs[964].ttft = 12.859306239000034
outputs[965].ttft = 13.093689011000038
outputs[966].ttft = 13.093260913000108
outputs[967].ttft = 13.056585418000054
outputs[968].ttft = 13.056511996999916
outputs[969].ttft = 13.02167570000006
outputs[970].ttft = 13.021263618000035
outputs[971].ttft = 12.949083309000002
outputs[972].ttft = 0.0
outputs[973].ttft = 13.194226416999982
outputs[974].ttft = 13.365348046000008
outputs[975].ttft = 13.365155831000038
outputs[976].ttft = 13.573356140999977
outputs[977].ttft = 13.572775389000071
outputs[978].ttft = 0.0
outputs[979].ttft = 13.572208252999985
outputs[980].ttft = 13.572183773999996
outputs[981].ttft = 13.57197781100001
outputs[982].ttft = 13.575568405000013
outputs[983].ttft = 13.575136322999924
outputs[984].ttft = 13.539561266000078
outputs[985].ttft = 13.539579519999961
outputs[986].ttft = 13.53895594900007
outputs[987].ttft = 13.538710520999985
outputs[988].ttft = 13.53848665800001
outputs[989].ttft = 13.538283157000023
outputs[990].ttft = 13.574429370999951
outputs[991].ttft = 13.537559570999974
outputs[992].ttft = 13.537111277999998
outputs[993].ttft = 13.536676790000001
outputs[994].ttft = 13.604230460000053
outputs[995].ttft = 13.638546530999974
outputs[996].ttft = 13.673045422000087
outputs[997].ttft = 13.941003878999936
outputs[998].ttft = 13.907465814000034
outputs[999].ttft = 13.907039113999986
outputs[1000].ttft = 13.906602420000013
outputs[1001].ttft = 13.90630502900001
outputs[1002].ttft = 13.905961641999966
outputs[1003].ttft = 13.905479096000022
outputs[1004].ttft = 13.940741718000027
outputs[1005].ttft = 13.97670189400003
outputs[1006].ttft = 14.043966775000058
outputs[1007].ttft = 14.078726697999969
outputs[1008].ttft = 14.047028792999981
outputs[1009].ttft = 14.010347966999916
outputs[1010].ttft = 14.009853136999936
outputs[1011].ttft = 14.044017077000035
outputs[1012].ttft = 14.077451531000065
outputs[1013].ttft = 14.078911024999911
outputs[1014].ttft = 14.121393589000036
outputs[1015].ttft = 14.120998695000026
outputs[1016].ttft = 13.946035208000012
outputs[1017].ttft = 13.945248784
outputs[1018].ttft = 14.061186647
outputs[1019].ttft = 14.061065375999988
outputs[1020].ttft = 14.060818874000006
outputs[1021].ttft = 14.060551874999987
outputs[1022].ttft = 14.060141815999941
outputs[1023].ttft = 14.027615679000064

============ Serving Benchmark Result ============
Backend:                                 vllm      
Traffic request rate:                    inf       
Successful requests:                     935       
Long requests:                           119       
Short requests:                          816       
Benchmark duration (s):                  35.72     
Total input tokens:                      486769    
Total generated tokens:                  935       
Total generated tokens (retokenized):    921       
Request throughput (req/s):              26.18     
Input token throughput (tok/s):          13627.57  
Output token throughput (tok/s):         26.18     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   13832.06  
Median E2E Latency (ms):                 13538.72  
P95 E2E Latency (ms):                    20964.50  
P99 E2E Latency (ms):                    21372.14  
Long requests Mean E2E Latency (ms):     13843.94782231933
Short requests Mean E2E Latency (ms):    13830.325115153186
Long requests Median E2E Latency (ms):   13256.71128800002
Short requests Median E2E Latency (ms):  13572.20715599999
Long requests P95 E2E Latency (ms):      21055.96142549997
Short requests P95 E2E Latency (ms):     20964.280571250045
Long requests P99 E2E Latency (ms):      21710.688027839966
Short requests P99 E2E Latency (ms):     21371.496230400007
---------------Time to First Token----------------
Mean TTFT (ms):                          13630.78  
Median TTFT (ms):                        13475.21  
P95 TTFT (ms):                           20964.28  
P99 TTFT (ms):                           21372.13  
Long Requests Mean TTFT (ms):            12693.76  
Short Requests Mean TTFT (ms):           13767.43  
Long Requests Median TTFT (ms):          12719.37  
Short Requests Median TTFT (ms):         13555.78  
Long Requests P95 TTFT (ms):             20835.36  
Short Requests P95 TTFT (ms):            20964.27  
Long Requests P99 TTFT (ms):             21710.68  
Short Requests P99 TTFT (ms):            21371.49  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================